{
    "medicina": [
        {
            "texto": "Todos, desde que somos pequeños, damos señales de lo que nos gusta y lo que nos disgusta. La vocación viene con nosotros desde que llegamos al mundo y, con el paso de los años, vamos desarrollándola cada vez más. Para algunos es más clara que para otros, por lo que si todavía no sabes cuál es tu vocación, solo es necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas.  En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos. Por eso, conocerás sobre la Medicina y su importancia: El término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano. Medicina también se utiliza como sinónimo de medicamento (del latín medicamentum), que es la sustancia que permite prevenir, aliviar o curar las enfermedades o sus secuelas. Como si no fuera claro, la medicina juega un papel fundamental en la sociedad. Es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte. ¿De qué manera está involucrada la medicina a lo largo de todas las etapas de la vida? En la concepción: en el caso de una pareja con esterilidad, la medicina les ofrece a ambos la oportunidad de tener hijos propios. En este caso, la medicina está superando y tratando un problema de naturaleza. Durante el embarazo: con la Medicina se protege tanto a la madre como  al embrión y al feto, dándole a conocer a la futura madre los cuidados que debe tener, la dieta y los ejercicios que deberá manejar luego de convertirse en mamá. Así mismo, se mantiene el embarazo en constante chequeo durante los 9 meses de su duración, se le hacen sus ecografías y se prepara todo lo concerniente para un parto saludable y sin contratiempos. Durante el parto: se atiende a la madre y su hijo, bien sea por cesárea o parto natural. Después del parto: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud. Al crecer: los niños, desde su nacimiento y hasta los 6 años, son atendidos por médicos pediatras, quienes explican cómo alimentarlos, cuidarlos y controlar y chequear su salud. Durante la infancia y adolescencia: se hacen seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo. En la adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos. En la muerte: para identificar causas y brindar también prevención de la enfermedad a su familia. Como puedes ver, la medicina es una ciencia que está presente a lo largo de la vida y estudia los orígenes de las enfermedades de forma que puedan atenderse efectivamente a través del diagnóstico, prevención y tratamiento de las enfermedades que presenta el cuerpo humano. Alrededor de la medicina hay múltiples mitos y verdades sobre esta carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud.",
            "fuente": "https://www.unbosque.edu.co/blog-universidad-el-bosque/que-es-la-medicina",
            "preguntas": [
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Es una de las profesiones que atiende y protege la salud de las ____ desde antes de nacer hasta el día de su muerte.",
                    "opciones": [
                        "que",
                        "su",
                        "personas",
                        "la"
                    ],
                    "respuesta_correcta": "personas",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Como puedes ver, la medicina es una ciencia que está presente a lo largo de la vida y estudia los orígenes de las enfermedades de forma que puedan ____ efectivamente a través del diagnóstico, prevención y tratamiento de las enfermedades que presenta el cuerpo humano.",
                    "opciones": [
                        "atenderse",
                        "la",
                        "de",
                        "enfermedades"
                    ],
                    "respuesta_correcta": "atenderse",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿De qué manera está involucrada la medicina a lo largo de todas las etapas de la vida?",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Como puedes ver, la medicina es una ciencia que está presente a lo largo de la vida y estudia los orígenes de las enfermedades de forma que puedan atenderse efectivamente a través del diagnóstico, prevención y tratamiento de las enfermedades que presenta el cuerpo humano.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? En la muerte: para identificar causas ____ brindar también prevención de la enfermedad a su familia.",
                    "opciones": [
                        "____",
                        "y",
                        "su",
                        "prevención"
                    ],
                    "respuesta_correcta": "y",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Después del parto: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto ____ y condiciones de salud.",
                    "opciones": [
                        "de",
                        "____",
                        "Después",
                        "desarrollo"
                    ],
                    "respuesta_correcta": "desarrollo",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Medicina también se utiliza como sinónimo de medicamento (del latín medicamentum), que es la sustancia que permite prevenir, aliviar ____ curar las enfermedades o sus secuelas.",
                    "opciones": [
                        "o",
                        "permite",
                        "sinónimo",
                        "utiliza"
                    ],
                    "respuesta_correcta": "o",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Alrededor de la medicina hay múltiples carrera, y verdades sobre esta carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Medicina también se utiliza como sinónimo de medicamento (del latín medicamentum), que es la sustancia que permite prevenir, aliviar ____ curar las enfermedades o sus secuelas.",
                    "opciones": [
                        "o",
                        "se",
                        "sus",
                        "latín"
                    ],
                    "respuesta_correcta": "o",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "En En adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                }
            ]
        },
        {
            "texto": "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones. Los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar tejidos dañados, extraer tumores o corregir anomalías. La cirugía se puede clasificar en diferentes tipos, dependiendo de la urgencia, el propósito y la técnica utilizada. La cirugía de emergencia se realiza inmediatamente para salvar la vida del paciente, como en el caso de un trauma grave o una apendicitis aguda. La cirugía electiva, por otro lado, se planifica con antelación y no es de urgencia, como una cirugía estética o una reparación de hernia. La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas incisiones y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de recuperación y el riesgo de complicaciones. La cirugía robótica es una evolución de la cirugía mínimamente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión. La formación de un cirujano es rigurosa y extensa. Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años. Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones. Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras. La cirugía es una parte vital del sistema de salud y ha avanzado significativamente con el tiempo. Las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva.",
            "fuente": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/types-of-surgery",
            "preguntas": [
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar tejidos ____ extraer tumores o corregir anomalías.",
                    "opciones": [
                        "humano,",
                        "de",
                        "interior",
                        "dañados,"
                    ],
                    "respuesta_correcta": "dañados,",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "La formación de La cirujano es rigurosa y extensa.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la ____ cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                    "opciones": [
                        "en",
                        "la",
                        "entre",
                        "cirugía"
                    ],
                    "respuesta_correcta": "cirugía",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Durante la residencia, los médicos médicos capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La formación de un cirujano es ____ y extensa.",
                    "opciones": [
                        "rigurosa",
                        "formación",
                        "es",
                        "La"
                    ],
                    "respuesta_correcta": "rigurosa",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "La cirugía electiva, por otro lado, se planifica con antelación y no es de urgencia, como una cirugía estética o una reparación de hernia.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Durante la residencia, los médicos reciben capacitación intensiva en ____ quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                    "opciones": [
                        "técnicas",
                        "complicaciones.",
                        "y",
                        "en"
                    ],
                    "respuesta_correcta": "técnicas",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La formación de un cirujano es rigurosa y ____",
                    "opciones": [
                        "un",
                        "La",
                        "es",
                        "extensa."
                    ],
                    "respuesta_correcta": "extensa.",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "La cirugía es una parte vital del sistema salud salud y ha avanzado significativamente con el tiempo.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                }
            ]
        }
    ],
    "pedagogía en inglés": [
        {
            "texto": "La carrera de Pedagogía en Inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés. Durante su formación los futuros docentes tendrán oportunidades de conocer, reflexionar, integrar saberes, interactuar y desempeñarse como profesores de inglés a nivel escolar de enseñanza básica y medio y también como miembros de una comunidad de pares fuertemente interconectada por la tecnología y la globalización. La carrera ofrecerá un ambiente de estudio y de convivencia donde se hable inglés y donde también habrá oportunidades de interactuar y de aprender con personas cuya lengua nativa es el inglés. Ámbitos de dominio y certificación de competencias Dominio del inglés equivalente al estándar C1 del Common European Framework of Reference for Language (CEF), demostrado a través de exámenes internacionales en el noveno semestre y mediante aplicación de mediciones referenciales intermedias durante la carrera. Dominio de la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés. Programa de formación El plan de estudio de la carrera tiene un enfoque comunicativo que integra progresivamente el desarrollo de las habilidades de comprensión lectora, comprensión auditiva, expresión oral y expresión escrita, y aborda el aprendizaje de la lingüística desde una perspectiva aplicada. Su foco radica en el aprendizaje y enseñanza de la lengua inglesa en el contexto escolar nacional y de acuerdo con el Marco Curricular del Mineduc. Se nutre de la experiencia internacional y de la investigación sobre adquisición de la lengua como idioma extranjero, y de los estudios sobre procesos cognitivos, entre otros ámbitos. La malla curricular se estructura de acuerdo a 5 ejes o líneas de formación: Aprendizaje de la Lengua: Tiene como propósito desarrollar las competencias de la comunicación en inglés avanzado (nivel C1, del Common European Framework), su conocimiento formal y los aspectos culturales asociados a la lengua. Esta línea de aprendizaje tiene una duración de nueve semestres de la carrera y también incluye asignaturas de fundamentos léxicos y gramaticales de la lengua, lingüística y cultura de los países angloparlantes. Se fomenta la exposición permanente a la lengua inglesa tanto en clases formales como en lectura de bibliografía en inglés, ayudantías, medios audiovisuales, programas en internet, participación en actividades con profesores invitados extranjeros, presentaciones y congresos de interés para los estudiantes, entre otros. Enseñanza de la Lengua: ¿Cómo enseñar inglés? ¿Cuáles son las teorías y estrategias que permitirán lograr aprendizajes significativos en mis futuros estudiantes? ¿Cómo integrar inglés al quehacer escolar? ¿Cómo se pueden ocupar las tecnologías de la información en mi labor docente en el futuro? ¿Cómo y qué evaluar en inglés? ¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés? Estas serán algunas de las preguntas que orientarán el eje de enseñanza de la lengua y que serán abordadas en asignaturas como metodología, evaluación y planificación curricular entre otras. Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares. Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés. Esta evidencia permitirá informar y fundamentar las decisiones pedagógicas para mejorar el proceso de enseñanza-aprendizaje. En esta línea formativa se aborda el desarrollo de competencias para formular problemas y preguntas de investigación aplicada y relevante al contexto escolar y a la enseñanza-aprendizaje de inglés, para diseñar instrumentos de recolección de datos y su análisis, para revisar literatura y elaborar marcos teóricos sobre el problema de estudio. El desarrollo de estas competencias conducirá al grado de Licenciado en Educación. Formación General: Aborda el conocimiento, comprensión y aplicación de valores como el respecto a los derechos humanos, ejercicio de la ciudadanía, temas relacionados a la diversidad, a la inclusión y a la equidad, que son claves para la formación de un docente con altas expectativas de todos sus estudiantes. A la vez, esta línea formativa incluye el aprendizaje de las políticas públicas en educación para analizar cómo estas inciden en el desarrollo de la enseñanza y aprendizaje del inglés en Chile y en otros países. Además los estudiantes de la universidad toman cuatro asignaturas de formación general de su propia elección en otras Facultades. Formación Profesional y Práctica: La carrera desarrolla competencias para la formación práctica a través de toda la carrera. Esto tiene como propósito ofrecer variadas oportunidades, algunas desarrolladas en la universidad y otras en los centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e integración entre teoría y práctica a través de la evaluación y planificación de unidades de aprendizaje en inglés. De esta manera se fomenta una capacidad reflexiva estrechamente vinculada al desarrollo de un “saber hacer” que preparará al estudiante para enfrentar adecuadamente su trabajo como profesor al egreso de la carrera.",
            "fuente": "https://educacion.udp.cl/carreras/pedagogia-en-ingles/",
            "preguntas": [
                {
                    "pregunta": "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Formación General: Aborda el conocimiento, comprensión y aplicación de valores como el respecto a los derechos humanos, ejercicio de la ciudadanía, temas relacionados a la diversidad, a la inclusión y a la equidad, que son claves para la formación de un docente con altas expectativas de todos sus estudiantes.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Esta línea de aprendizaje tiene una duración de nueve semestres de la carrera y también incluye asignaturas de fundamentos léxicos y gramaticales de la lengua, lingüística y cultura de los países angloparlantes.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esta evidencia ____ informar y fundamentar las decisiones pedagógicas para mejorar el proceso de enseñanza-aprendizaje.",
                    "opciones": [
                        "de",
                        "para",
                        "el",
                        "permitirá"
                    ],
                    "respuesta_correcta": "permitirá",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? ¿Cómo se pueden ocupar las tecnologías de la información en mi labor ____ en el futuro?",
                    "opciones": [
                        "las",
                        "tecnologías",
                        "se",
                        "docente"
                    ],
                    "respuesta_correcta": "docente",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La carrera de Pedagogía en Inglés tiene como propósito ____ profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés.",
                    "opciones": [
                        "de",
                        "____",
                        "jóvenes",
                        "formar"
                    ],
                    "respuesta_correcta": "formar",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Se nutre de la experiencia internacional y de la investigación sobre adquisición de la lengua como idioma extranjero, y de y estudios sobre procesos cognitivos, entre otros ámbitos.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esto tiene como propósito ofrecer variadas oportunidades, algunas desarrolladas en la universidad y otras en los centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e integración entre teoría y práctica a ____ de la evaluación y planificación de unidades de aprendizaje en inglés.",
                    "opciones": [
                        "través",
                        "evaluación",
                        "a",
                        "sinergia"
                    ],
                    "respuesta_correcta": "través",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Dominio ____ la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés.",
                    "opciones": [
                        "como",
                        "la",
                        "de",
                        "didáctica"
                    ],
                    "respuesta_correcta": "de",
                    "tipo": "alternativas"
                }
            ]
        },
        {
            "texto": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés. Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
            "fuente": "https://www.teachingenglish.org.uk/article/digital-literacy",
            "preguntas": [
                {
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a incluir de redes sociales.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esto puede incluir ____ creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "opciones": [
                        "sociales.",
                        "la",
                        "a",
                        "puede"
                    ],
                    "respuesta_correcta": "la",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La alfabetización digital en la ____ del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "opciones": [
                        "alfabetización",
                        "del",
                        "la",
                        "enseñanza"
                    ],
                    "respuesta_correcta": "enseñanza",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esto puede incluir la ____ de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "opciones": [
                        "sociales.",
                        "través",
                        "a",
                        "creación"
                    ],
                    "respuesta_correcta": "creación",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La alfabetización digital ____ la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "opciones": [
                        "digitales,",
                        "en",
                        "para",
                        "inteligentes,"
                    ],
                    "respuesta_correcta": "en",
                    "tipo": "alternativas"
                }
            ]
        }
    ],
    "programación": [
        {
            "texto": "La Inteligencia Artificial (IA) es un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas. Implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones. La IA abarca varios subcampos, incluyendo el aprendizaje automático, el procesamiento del lenguaje natural, la visión por computadora y la robótica. El aprendizaje automático es un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita. El procesamiento del lenguaje natural permite que las máquinas comprendan e interpreten el lenguaje humano, lo que permite aplicaciones como asistentes virtuales y traducción de idiomas. La visión por computadora permite que las computadoras perciban y analicen información visual, facilitando el reconocimiento de imágenes y la detección de objetos. La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana. La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el entretenimiento. En la salud, la IA se utiliza para el diagnóstico médico, el descubrimiento de medicamentos y los planes de tratamiento personalizados. Las instituciones financieras utilizan la IA para la detección de fraudes, la evaluación de riesgos y el comercio algorítmico. Los coches autónomos emplean algoritmos de IA para la navegación y la detección de obstáculos. Los chatbots y sistemas de recomendación impulsados por IA mejoran las experiencias de los clientes, mientras que los asistentes virtuales como Siri y Alexa ayudan con las tareas diarias. Si bien la IA ofrece un inmenso potencial, las consideraciones éticas y el desarrollo responsable son cruciales. Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad. A medida que la tecnología avanza, la IA continúa evolucionando, abriendo nuevas posibilidades y desafíos. La investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas.",
            "fuente": "https://planderecuperacion.gob.es/noticias/que-es-inteligencia-artificial-ia-prtr#:~:text=La%20inteligencia%20artificial%20(IA)%20es,el%20razonamiento%20y%20la%20percepci%C3%B3n.",
            "preguntas": [
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Las discusiones sobre la ética ____ la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad.",
                    "opciones": [
                        "____",
                        "como",
                        "de",
                        "IA"
                    ],
                    "respuesta_correcta": "de",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El ____ del lenguaje natural permite que las máquinas comprendan e interpreten el lenguaje humano, lo que permite aplicaciones como asistentes virtuales y traducción de idiomas.",
                    "opciones": [
                        "lenguaje",
                        "procesamiento",
                        "____",
                        "e"
                    ],
                    "respuesta_correcta": "procesamiento",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "A medida que la tecnología avanza, la IA IA evolucionando, abriendo nuevas posibilidades y desafíos.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Los coches autónomos emplean algoritmos de IA para ____ navegación y la detección de obstáculos.",
                    "opciones": [
                        "autónomos",
                        "Los",
                        "detección",
                        "la"
                    ],
                    "respuesta_correcta": "la",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "La investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El procesamiento del ____ natural permite que las máquinas comprendan e interpreten el lenguaje humano, lo que permite aplicaciones como asistentes virtuales y traducción de idiomas.",
                    "opciones": [
                        "idiomas.",
                        "e",
                        "lenguaje",
                        "traducción"
                    ],
                    "respuesta_correcta": "lenguaje",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La visión por computadora permite que las computadoras perciban y analicen información ____ facilitando el reconocimiento de imágenes y la detección de objetos.",
                    "opciones": [
                        "y",
                        "visual,",
                        "las",
                        "____"
                    ],
                    "respuesta_correcta": "visual,",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Implica el desarrollo de sistemas ____ y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones.",
                    "opciones": [
                        "de",
                        "Implica",
                        "informáticos",
                        "requieren"
                    ],
                    "respuesta_correcta": "informáticos",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Los chatbots y sistemas de recomendación impulsados por ____ mejoran las experiencias de los clientes, mientras que los asistentes virtuales como Siri y Alexa ayudan con las tareas diarias.",
                    "opciones": [
                        "con",
                        "que",
                        "impulsados",
                        "IA"
                    ],
                    "respuesta_correcta": "IA",
                    "tipo": "alternativas"
                }
            ]
        },
        {
            "texto": "El aprendizaje automático, también conocido como machine learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos. A diferencia de los enfoques tradicionales de programación, donde se definen reglas explícitas para cada tarea, el aprendizaje automático permite que los sistemas informáticos identifiquen patrones y relaciones en los datos, y hagan predicciones o tomen decisiones basadas en esos hallazgos. El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo. El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente. El objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos. En el aprendizaje no supervisado, el modelo se entrena con datos no etiquetados y debe identificar patrones o estructuras ocultas sin ninguna guía previa. Esto es útil para tareas como la agrupación (clustering) y la reducción de dimensionalidad. El aprendizaje por refuerzo se basa en el principio de aprendizaje a través de la interacción con un entorno. El agente recibe recompensas o penalizaciones en función de sus acciones y ajusta su comportamiento para maximizar la recompensa acumulada. Esta técnica es ampliamente utilizada en robótica y juegos. El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming. Sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de la información. La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes.",
            "fuente": "https://www.ibm.com/cloud/learn/machine-learning",
            "preguntas": [
                {
                    "pregunta": "Esto es útil para tareas como la agrupación (clustering) y la reducción reducción dimensionalidad.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esta técnica es ampliamente ____ en robótica y juegos.",
                    "opciones": [
                        "Esta",
                        "juegos.",
                        "y",
                        "utilizada"
                    ],
                    "respuesta_correcta": "utilizada",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "Esta técnica es ampliamente utilizada en robótica y juegos.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El agente recibe recompensas o penalizaciones en función de ____ acciones y ajusta su comportamiento para maximizar la recompensa acumulada.",
                    "opciones": [
                        "para",
                        "____",
                        "recompensa",
                        "sus"
                    ],
                    "respuesta_correcta": "sus",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El agente recibe recompensas o penalizaciones en función de ____ acciones y ajusta su comportamiento para maximizar la recompensa acumulada.",
                    "opciones": [
                        "recompensas",
                        "su",
                        "sus",
                        "agente"
                    ],
                    "respuesta_correcta": "sus",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por ____",
                    "opciones": [
                        "supervisado",
                        "principales:",
                        "refuerzo.",
                        "puede"
                    ],
                    "respuesta_correcta": "refuerzo.",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "nuevos objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "El objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? El aprendizaje automático, también conocido como machine learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las ____ aprender de los datos.",
                    "opciones": [
                        "computadoras",
                        "learning,",
                        "rama",
                        "y"
                    ],
                    "respuesta_correcta": "computadoras",
                    "tipo": "alternativas"
                }
            ]
        },
        {
            "texto": "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje. Python es un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura. Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial. Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero. Python es especialmente popular en el campo de la ciencia de datos y el aprendizaje automático. Herramientas como Pandas, NumPy, y Matplotlib facilitan el análisis de datos y la creación de visualizaciones, mientras que bibliotecas como TensorFlow y PyTorch permiten el desarrollo de modelos de aprendizaje automático y redes neuronales. Además, frameworks como Django y Flask se utilizan para el desarrollo de aplicaciones web, proporcionando estructuras robustas y escalables. La comunidad de Python es grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los desarrolladores de todos los niveles. Los programadores pueden colaborar en proyectos de código abierto, participar en conferencias y acceder a una amplia gama de documentación y foros en línea. Aprender Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas. Su aplicabilidad en diversas disciplinas lo convierte en una herramienta valiosa para científicos, ingenieros, analistas de datos, y muchos otros. En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades.",
            "fuente": "https://www.python.org/doc/essays/blurb/",
            "preguntas": [
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de ____ mucho código desde cero.",
                    "opciones": [
                        "desarrolladores",
                        "____",
                        "escribir",
                        "necesidad"
                    ],
                    "respuesta_correcta": "escribir",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el ____ web y la inteligencia artificial.",
                    "opciones": [
                        "biblioteca",
                        "de",
                        "desarrollo",
                        "y"
                    ],
                    "respuesta_correcta": "desarrollo",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados sus buscan expandir sus habilidades y capacidades.",
                    "respuesta_correcta": "Falso",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Además, frameworks como Django y Flask ____ utilizan para el desarrollo de aplicaciones web, proporcionando estructuras robustas y escalables.",
                    "opciones": [
                        "Flask",
                        "se",
                        "aplicaciones",
                        "y"
                    ],
                    "respuesta_correcta": "se",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje.",
                    "respuesta_correcta": "Verdadero",
                    "tipo": "verdadero_falso"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Su aplicabilidad en diversas disciplinas lo convierte en una ____ valiosa para científicos, ingenieros, analistas de datos, y muchos otros.",
                    "opciones": [
                        "muchos",
                        "datos,",
                        "ingenieros,",
                        "herramienta"
                    ],
                    "respuesta_correcta": "herramienta",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? Esto permite a los desarrolladores realizar una amplia gama de proyectos ____ necesidad de escribir mucho código desde cero.",
                    "opciones": [
                        "de",
                        "código",
                        "una",
                        "sin"
                    ],
                    "respuesta_correcta": "sin",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? En resumen, la programación en ____ ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades.",
                    "opciones": [
                        "lo",
                        "potencia",
                        "Python",
                        "tanto"
                    ],
                    "respuesta_correcta": "Python",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? La comunidad de Python ____ grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los desarrolladores de todos los niveles.",
                    "opciones": [
                        "una",
                        "es",
                        "abundancia",
                        "Python"
                    ],
                    "respuesta_correcta": "es",
                    "tipo": "alternativas"
                },
                {
                    "pregunta": "¿Qué palabra completa correctamente la siguiente oración? ____ Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas.",
                    "opciones": [
                        "profesionales",
                        "Aprender",
                        "que",
                        "es"
                    ],
                    "respuesta_correcta": "Aprender",
                    "tipo": "alternativas"
                }
            ]
        }
    ]
}