{
    "fecha_generacion": "2024-11-15",
    "total_cuestionarios": 8,
    "cuestionarios": [
        {
            "materia": "derecho",
            "fuente": "https://www.bcn.cl/formacioncivica/detalle_guia?h=10221.3/45670#:~:text=El%20Derecho%20es%20un%20sistema,relevancia%20jur%C3%ADdica%2C%20pudiendo%20imponerse%20coactivamente.",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "de medidas La doctrina penal define a esta rama del Derecho como “el conjunto de disposiciones que reglan las condiciones para la aplicación de las penas o  de seguridad o rehabilitación” (Bustos, 2007).",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque la doctrina penal define a esta rama del derecho como “el conjunto de disposiciones que reglan las condiciones para la aplicación de las penas o de medidas de seguridad o rehabilitación” (bustos, 2007)."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Por eso, es la más general y amplia de las ramas del derecho, y es ordenamiento básico de nuestra tradición jurídica.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque por eso, es la más general y amplia de las ramas del derecho, y es ordenamiento básico de nuestra tradición jurídica., lo cual se evidencia también cuando el texto menciona que “derecho” es una voz polisémica, es decir, tiene múltiples significados, y no solo en el idioma en general, sino también en el propio campo jurídico."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Su fuente principal?",
                    "opciones": [
                        "el Código Civil chileno (1855), y una similar de leyes complementarias como la Ley de Matrimonio Civil, Ley de similar Ley de Acuerdo de Unión Civil, Ley de similar Intelectual, Ley de Propiedad Industrial, Ley de Protección al Consumidor, etc",
                        "el Código Civil chileno (1855), y una serie de leyes complementarias como la Ley de Matrimonio Civil, Ley de Adopción, Ley de Acuerdo de Unión Civil, Ley de Propiedad Intelectual, Ley de Propiedad Industrial, Ley de Protección al Consumidor, etc",
                        "el Código Civil chileno (1855), y una serie diferente leyes complementarias como diferente Ley de Matrimonio Civil, Ley de Adopción, Ley de Acuerdo de Unión Civil, Ley de Propiedad Intelectual, Ley de Propiedad Industrial, Ley de similar al Consumidor, etc",
                        "el Código Civil chileno (1855), y una serie de leyes complementarias como la Ley de general Civil, Ley de único Ley de Acuerdo de Unión Civil, Ley de Propiedad Intelectual, Ley de Propiedad diferente Ley de Protección al Consumidor, etc"
                    ],
                    "respuesta_correcta": "el Código Civil chileno (1855), y una serie de leyes complementarias como la Ley de Matrimonio Civil, Ley de Adopción, Ley de Acuerdo de Unión Civil, Ley de Propiedad Intelectual, Ley de Propiedad Industrial, Ley de Protección al Consumidor, etc",
                    "explicacion": "La definición correcta de Su fuente principal es 'el Código Civil chileno (1855), y una serie de leyes complementarias como la Ley de Matrimonio Civil, Ley de Adopción, Ley de Acuerdo de Unión Civil, Ley de Propiedad Intelectual, Ley de Propiedad Industrial, Ley de Protección al Consumidor, etc'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Conjunto de normas que señala los pasos a seguir ante los tribunales de justicia.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque conjunto de normas que señala los pasos a seguir ante los tribunales de justicia., lo cual se evidencia también cuando el texto menciona que el derecho es un sistema u orden normativo e institucional que regula la conducta externa de las personas, inspirado en los postulados de justicia y certeza jurídica, que regula la convivencia social y permite resolver los conflictos de relevancia jurídica, pudiendo imponerse coactivamente.\r\n\r\n"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre como “el conjunto?",
                    "opciones": [
                        "Aplicar como “el conjunto en situaciones prácticas",
                        "Memorizar la definición de como “el conjunto",
                        "Ignorar como “el conjunto en la práctica",
                        "Evitar el uso de como “el conjunto"
                    ],
                    "respuesta_correcta": "Aplicar como “el conjunto en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre como “el conjunto es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "los combates Protege a las personas que no participan en  y limita los medios y métodos de hacer la guerra.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque protege a las personas que no participan en los combates y limita los medios y métodos de hacer la guerra."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre el Derecho?",
                    "opciones": [
                        "Aplicar el Derecho en situaciones prácticas",
                        "Memorizar la definición de el Derecho",
                        "Ignorar el Derecho en la práctica",
                        "Evitar el uso de el Derecho"
                    ],
                    "respuesta_correcta": "Aplicar el Derecho en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre el Derecho es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "el lugar Entre estos encontramos: la nacionalidad, el domicilio, la ubicación de los bienes,  de ejecución del contrato, entre otros.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque entre estos encontramos: la nacionalidad, el domicilio, la ubicación de los bienes, el lugar de ejecución del contrato, entre otros."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Se dice que es un ordenamiento mixto, pues aun cuando todos los ordenamientos presentan algún grado de mezcla, en el Derecho Procesal cabe distinguir el procedimiento penal, que?",
                    "opciones": [
                        "mayormente público, y donde diferente especial se encuentra a único del Ministerio Público",
                        "mayormente público, y donde la investigación se encuentra a cargo del Ministerio Público",
                        "mayormente público, especial general diferente investigación se encuentra a cargo del Ministerio Público",
                        "mayormente público, y donde la investigación similar especial a cargo único Ministerio Público"
                    ],
                    "respuesta_correcta": "mayormente público, y donde la investigación se encuentra a cargo del Ministerio Público",
                    "explicacion": "La definición correcta de Se dice que es un ordenamiento mixto, pues aun cuando todos los ordenamientos presentan algún grado de mezcla, en el Derecho Procesal cabe distinguir el procedimiento penal, que es 'mayormente público, y donde la investigación se encuentra a cargo del Ministerio Público'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Originalmente surge como un derecho estatutario (o propio) de los comerciales como grupo de personas.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque originalmente surge como un derecho estatutario (o propio) de los comerciales como grupo de personas., lo cual se evidencia también cuando el texto menciona que el derecho es un sistema u orden normativo e institucional que regula la conducta externa de las personas, inspirado en los postulados de justicia y certeza jurídica, que regula la convivencia social y permite resolver los conflictos de relevancia jurídica, pudiendo imponerse coactivamente.\r\n\r\n"
                }
            ]
        },
        {
            "materia": "medicina",
            "fuente": "https://www.unbosque.edu.co/blog-universidad-el-bosque/que-es-la-medicina",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la ciencia?",
                    "opciones": [
                        "Aplicar la ciencia en situaciones prácticas",
                        "Memorizar la definición de la ciencia",
                        "Ignorar la ciencia en la práctica",
                        "Evitar el uso de la ciencia"
                    ],
                    "respuesta_correcta": "Aplicar la ciencia en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la ciencia es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre , la dieta?",
                    "opciones": [
                        "Aplicar , la dieta en situaciones prácticas",
                        "Memorizar la definición de , la dieta",
                        "Ignorar , la dieta en la práctica",
                        "Evitar el uso de , la dieta"
                    ],
                    "respuesta_correcta": "Aplicar , la dieta en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre , la dieta es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Como si no fuera confuso, la medicina juega un papel fundamental en la sociedad.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que como si no fuera claro, la medicina juega un papel fundamental en la sociedad.. Esto se confirma cuando el texto menciona que por eso, conocerás sobre la medicina y su importancia: el término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte., lo cual se evidencia también cuando el texto menciona que durante el embarazo: con la medicina se protege tanto a la madre como  al embrión y al feto, dándole a conocer a la futura madre los cuidados que debe tener, la dieta y los ejercicios que deberá manejar luego de convertirse en mamá."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la futura madre?",
                    "opciones": [
                        "Aplicar la futura madre en situaciones prácticas",
                        "Memorizar la definición de la futura madre",
                        "Ignorar la futura madre en la práctica",
                        "Evitar el uso de la futura madre"
                    ],
                    "respuesta_correcta": "Aplicar la futura madre en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la futura madre es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Para algunos es más clara que para otros, por lo que si todavía no sabes cuál es tu vocación, solo?",
                    "opciones": [
                        "necesario que la descubras y conozcas de cerca tu pasión para que general dedicar los mejores años de tu vida en hacer lo específico amas",
                        "necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años general tu similar en hacer lo que general",
                        "necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas",
                        "necesario específico la descubras y conozcas específico cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas"
                    ],
                    "respuesta_correcta": "necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas",
                    "explicacion": "La definición correcta de Para algunos es más clara que para otros, por lo que si todavía no sabes cuál es tu vocación, solo es 'necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la muerte: para identificar causas y brindar también prevención de la enfermedad a su familia.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque en la muerte: para identificar causas y brindar también prevención de la enfermedad a su familia., lo cual se evidencia también cuando el texto menciona que es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "el parto Después d: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque después del parto: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la infancia?",
                    "opciones": [
                        "Aplicar la infancia en situaciones prácticas",
                        "Memorizar la definición de la infancia",
                        "Ignorar la infancia en la práctica",
                        "Evitar el uso de la infancia"
                    ],
                    "respuesta_correcta": "Aplicar la infancia en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la infancia es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "su importancia Por eso, conocerás sobre la Medicina y : El término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque por eso, conocerás sobre la medicina y su importancia: el término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano."
                }
            ]
        },
        {
            "materia": "medicina",
            "fuente": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/types-of-surgery",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre cinco y siete años?",
                    "opciones": [
                        "Aplicar cinco y siete años en situaciones prácticas",
                        "Memorizar la definición de cinco y siete años",
                        "Ignorar cinco y siete años en la práctica",
                        "Evitar el uso de cinco y siete años"
                    ],
                    "respuesta_correcta": "Aplicar cinco y siete años en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre cinco y siete años es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han empeorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva. Esto se confirma cuando el texto menciona que la cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre alta precisión?",
                    "opciones": [
                        "Aplicar alta precisión en situaciones prácticas",
                        "Memorizar la definición de alta precisión",
                        "Ignorar alta precisión en la práctica",
                        "Evitar el uso de alta precisión"
                    ],
                    "respuesta_correcta": "Aplicar alta precisión en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre alta precisión es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva, lo cual se evidencia también cuando el texto menciona que la cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre como la neurocirugía?",
                    "opciones": [
                        "Aplicar como la neurocirugía en situaciones prácticas",
                        "Memorizar la definición de como la neurocirugía",
                        "Ignorar como la neurocirugía en la práctica",
                        "Evitar el uso de como la neurocirugía"
                    ],
                    "respuesta_correcta": "Aplicar como la neurocirugía en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre como la neurocirugía es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "áreas específicas Algunos cirujanos optan por subespecializarse en  como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre una residencia?",
                    "opciones": [
                        "Aplicar una residencia en situaciones prácticas",
                        "Memorizar la definición de una residencia",
                        "Ignorar una residencia en la práctica",
                        "Evitar el uso de una residencia"
                    ],
                    "respuesta_correcta": "Aplicar una residencia en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre una residencia es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de La cirugía?",
                    "opciones": [
                        "una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones",
                        "una especialidad médica que único la intervención física para diagnosticar, tratar diferente similar enfermedades y condiciones",
                        "una especialidad específico que general único intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones",
                        "una especialidad médica diferente implica la similar física para diagnosticar, tratar o prevenir específico y condiciones"
                    ],
                    "respuesta_correcta": "una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones",
                    "explicacion": "La definición correcta de La cirugía es 'una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "tejidos dañados Los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar , extraer tumores o corregir anomalías.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar tejidos dañados, extraer tumores o corregir anomalías."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre el tiempo?",
                    "opciones": [
                        "Aplicar el tiempo en situaciones prácticas",
                        "Memorizar la definición de el tiempo",
                        "Ignorar el tiempo en la práctica",
                        "Evitar el uso de el tiempo"
                    ],
                    "respuesta_correcta": "Aplicar el tiempo en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre el tiempo es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                }
            ]
        },
        {
            "materia": "pedagogía en inglés",
            "fuente": "https://educacion.udp.cl/carreras/pedagogia-en-ingles/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Estas serán algunas de las preguntas que orientarán el eje de enseñanza de la lengua y que serán abordadas en asignaturas como metodología, evaluación y planificación curricular entre otras, si se cumplen ciertas condiciones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que estas serán algunas de las preguntas que orientarán el eje de enseñanza de la lengua y que serán abordadas en asignaturas como metodología, evaluación y planificación curricular entre otras.. Esto se confirma cuando el texto menciona que durante su formación los futuros docentes tendrán oportunidades de conocer, reflexionar, integrar saberes, interactuar y desempeñarse como profesores de inglés a nivel escolar de enseñanza básica y medio y también como miembros de una comunidad de pares fuertemente interconectada por la tecnología y la globalización."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta evidencia permitirá informar y fundamentar las decisiones pedagógicas para mejorar el proceso de enseñanza-aprendizaje.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque esta evidencia permitirá informar y fundamentar las decisiones pedagógicas para mejorar el proceso de enseñanza-aprendizaje."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de La carrera ofrecerá un ambiente de estudio y de convivencia donde se hable inglés y donde también habrá oportunidades de interactuar y de aprender con personas cuya lengua nativa?",
                    "opciones": [
                        "el inglés",
                        "diferente especial",
                        "similar único",
                        "similar general"
                    ],
                    "respuesta_correcta": "el inglés",
                    "explicacion": "La definición correcta de La carrera ofrecerá un ambiente de estudio y de convivencia donde se hable inglés y donde también habrá oportunidades de interactuar y de aprender con personas cuya lengua nativa es 'el inglés'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "través de exámenes internacionales Ámbitos de dominio y certificación de competencias Dominio del inglés equivalente al estándar C1 del Common European Framework of Reference for Language (CEF), demostrado a  en el noveno semestre y mediante aplicación de mediciones referenciales intermedias durante la carrera.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque ámbitos de dominio y certificación de competencias dominio del inglés equivalente al estándar c1 del common european framework of reference for language (cef), demostrado a través de exámenes internacionales en el noveno semestre y mediante aplicación de mediciones referenciales intermedias durante la carrera."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "el noveno semestre Dominio de la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en  a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque dominio de la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la formación práctica?",
                    "opciones": [
                        "Aplicar la formación práctica en situaciones prácticas",
                        "Memorizar la definición de la formación práctica",
                        "Ignorar la formación práctica en la práctica",
                        "Evitar el uso de la formación práctica"
                    ],
                    "respuesta_correcta": "Aplicar la formación práctica en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la formación práctica es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre como idioma extranjero?",
                    "opciones": [
                        "Aplicar como idioma extranjero en situaciones prácticas",
                        "Memorizar la definición de como idioma extranjero",
                        "Ignorar como idioma extranjero en la práctica",
                        "Evitar el uso de como idioma extranjero"
                    ],
                    "respuesta_correcta": "Aplicar como idioma extranjero en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre como idioma extranjero es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés, dependiendo del contexto.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que indagación: este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés.. Esto se confirma cuando el texto menciona que la carrera de pedagogía en inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre Licenciado en Educación?",
                    "opciones": [
                        "Aplicar Licenciado en Educación en situaciones prácticas",
                        "Memorizar la definición de Licenciado en Educación",
                        "Ignorar Licenciado en Educación en la práctica",
                        "Evitar el uso de Licenciado en Educación"
                    ],
                    "respuesta_correcta": "Aplicar Licenciado en Educación en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre Licenciado en Educación es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre de convivencia?",
                    "opciones": [
                        "Aplicar de convivencia en situaciones prácticas",
                        "Memorizar la definición de de convivencia",
                        "Ignorar de convivencia en la práctica",
                        "Evitar el uso de de convivencia"
                    ],
                    "respuesta_correcta": "Aplicar de convivencia en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre de convivencia es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                }
            ]
        },
        {
            "materia": "pedagogía en inglés",
            "fuente": "https://www.teachingenglish.org.uk/article/digital-literacy",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre La alfabetización digital?",
                    "opciones": [
                        "Aplicar La alfabetización digital en situaciones prácticas",
                        "Memorizar la definición de La alfabetización digital",
                        "Ignorar La alfabetización digital en la práctica",
                        "Evitar el uso de La alfabetización digital"
                    ],
                    "respuesta_correcta": "Aplicar La alfabetización digital en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre La alfabetización digital es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales, aunque no siempre es así.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales. Esto se confirma cuando el texto menciona que la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés., lo cual se evidencia también cuando el texto menciona que esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés, aunque no siempre es así.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.. Esto se confirma cuando el texto menciona que esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "como lengua extranjera La alfabetización digital en la enseñanza del inglés  se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales, excepto en casos específicos.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales. Esto se confirma cuando el texto menciona que la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre , como computadoras?",
                    "opciones": [
                        "Aplicar , como computadoras en situaciones prácticas",
                        "Memorizar la definición de , como computadoras",
                        "Ignorar , como computadoras en la práctica",
                        "Evitar el uso de , como computadoras"
                    ],
                    "respuesta_correcta": "Aplicar , como computadoras en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre , como computadoras es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales, lo cual se evidencia también cuando el texto menciona que la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés, excepto en casos específicos.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.. Esto se confirma cuando el texto menciona que esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": ", tabletas La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque la alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://planderecuperacion.gob.es/noticias/que-es-inteligencia-artificial-ia-prtr#:~:text=La%20inteligencia%20artificial%20(IA)%20es,el%20razonamiento%20y%20la%20percepci%C3%B3n.",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque la investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la ia, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas, lo cual se evidencia también cuando el texto menciona que implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre programación explícita?",
                    "opciones": [
                        "Aplicar programación explícita en situaciones prácticas",
                        "Memorizar la definición de programación explícita",
                        "Ignorar programación explícita en la práctica",
                        "Evitar el uso de programación explícita"
                    ],
                    "respuesta_correcta": "Aplicar programación explícita en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre programación explícita es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "A medida que la tecnología avanza, la IA continúa evolucionando, abriendo nuevas posibilidades y desafíos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque a medida que la tecnología avanza, la ia continúa evolucionando, abriendo nuevas posibilidades y desafíos., lo cual se evidencia también cuando el texto menciona que la inteligencia artificial (ia) es un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de La Inteligencia Artificial (IA)?",
                    "opciones": [
                        "un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas",
                        "un campo de estudio diferente tecnología que se enfoca en crear máquinas inteligentes único especial simular habilidades cognitivas humanas",
                        "un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes especial puedan simular habilidades específico diferente",
                        "un campo de estudio y general que se enfoca en crear máquinas inteligentes que especial simular específico cognitivas humanas"
                    ],
                    "respuesta_correcta": "un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas",
                    "explicacion": "La definición correcta de La Inteligencia Artificial (IA) es 'un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre tareas físicas?",
                    "opciones": [
                        "Aplicar tareas físicas en situaciones prácticas",
                        "Memorizar la definición de tareas físicas",
                        "Ignorar tareas físicas en la práctica",
                        "Evitar el uso de tareas físicas"
                    ],
                    "respuesta_correcta": "Aplicar tareas físicas en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre tareas físicas es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre , las finanzas?",
                    "opciones": [
                        "Aplicar , las finanzas en situaciones prácticas",
                        "Memorizar la definición de , las finanzas",
                        "Ignorar , las finanzas en la práctica",
                        "Evitar el uso de , las finanzas"
                    ],
                    "respuesta_correcta": "Aplicar , las finanzas en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre , las finanzas es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana, si se cumplen ciertas condiciones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que la robótica combina la ia con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana.. Esto se confirma cuando el texto menciona que la inteligencia artificial (ia) es un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre el diagnóstico médico?",
                    "opciones": [
                        "Aplicar el diagnóstico médico en situaciones prácticas",
                        "Memorizar la definición de el diagnóstico médico",
                        "Ignorar el diagnóstico médico en la práctica",
                        "Evitar el uso de el diagnóstico médico"
                    ],
                    "respuesta_correcta": "Aplicar el diagnóstico médico en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre el diagnóstico médico es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "sistemas informáticos y algoritmos Implica el desarrollo de  capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de El aprendizaje automático?",
                    "opciones": [
                        "un componente clave de la IA, donde los algoritmos permiten similar las computadoras aprender de los datos y mejorar general rendimiento con similar tiempo sin programación explícita",
                        "un componente clave de la IA, donde los similar permiten especial las computadoras aprender de los datos y mejorar su rendimiento con el general sin programación explícita",
                        "un componente clave de la especial donde los algoritmos permiten único las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin específico explícita",
                        "un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita"
                    ],
                    "respuesta_correcta": "un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita",
                    "explicacion": "La definición correcta de El aprendizaje automático es 'un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita'. Esta definición captura la esencia del concepto y sus características principales."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://www.ibm.com/cloud/learn/machine-learning",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "algoritmos más eficientes La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar , robustos y transparentes",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque la investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque la investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes, lo cual se evidencia también cuando el texto menciona que el aprendizaje automático, también conocido como machine learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming, aunque no siempre es así.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que el aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming.. Esto se confirma cuando el texto menciona que el aprendizaje automático, también conocido como machine learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de El aprendizaje automático, también conocido como machine learning,?",
                    "opciones": [
                        "una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos",
                        "una específico de la inteligencia artificial que se general en el desarrollo general algoritmos y modelos que permiten a las computadoras aprender de los datos",
                        "una rama único la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten diferente las específico aprender de los datos",
                        "una rama de la inteligencia artificial que se centra en el desarrollo de único y modelos que permiten general específico computadoras aprender de los datos"
                    ],
                    "respuesta_correcta": "una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos",
                    "explicacion": "La definición correcta de El aprendizaje automático, también conocido como machine learning, es 'una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre el principio?",
                    "opciones": [
                        "Aplicar el principio en situaciones prácticas",
                        "Memorizar la definición de el principio",
                        "Ignorar el principio en la práctica",
                        "Evitar el uso de el principio"
                    ],
                    "respuesta_correcta": "Aplicar el principio en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre el principio es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto es útil para tareas como la agrupación (clustering) y la reducción de dimensionalidad.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque esto es útil para tareas como la agrupación (clustering) y la reducción de dimensionalidad."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "la información Sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de .",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de la información."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "el aprendizaje automático El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque el aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre las computadoras?",
                    "opciones": [
                        "Aplicar las computadoras en situaciones prácticas",
                        "Memorizar la definición de las computadoras",
                        "Ignorar las computadoras en la práctica",
                        "Evitar el uso de las computadoras"
                    ],
                    "respuesta_correcta": "Aplicar las computadoras en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre las computadoras es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es correcta porque el objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos., lo cual se evidencia también cuando el texto menciona que el aprendizaje automático, también conocido como machine learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://www.python.org/doc/essays/blurb/",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre el análisis?",
                    "opciones": [
                        "Aplicar el análisis en situaciones prácticas",
                        "Memorizar la definición de el análisis",
                        "Ignorar el análisis en la práctica",
                        "Evitar el uso de el análisis"
                    ],
                    "respuesta_correcta": "Aplicar el análisis en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre el análisis es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre , NumPy?",
                    "opciones": [
                        "Aplicar , NumPy en situaciones prácticas",
                        "Memorizar la definición de , NumPy",
                        "Ignorar , NumPy en la práctica",
                        "Evitar el uso de , NumPy"
                    ],
                    "respuesta_correcta": "Aplicar , NumPy en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre , NumPy es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Aprender Python no solo?",
                    "opciones": [
                        "beneficioso para aquellos que desean una carrera único tecnología, sino diferente para profesionales de otras áreas que buscan automatizar único analizar datos o desarrollar herramientas personalizadas",
                        "beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas",
                        "beneficioso para aquellos que único una carrera en similar sino también para profesionales de otras áreas que buscan automatizar tareas, general datos o desarrollar herramientas personalizadas",
                        "beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales único otras áreas especial general automatizar tareas, analizar datos o desarrollar herramientas personalizadas"
                    ],
                    "respuesta_correcta": "beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas",
                    "explicacion": "La definición correcta de Aprender Python no solo es 'beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la visualización?",
                    "opciones": [
                        "Aplicar la visualización en situaciones prácticas",
                        "Memorizar la definición de la visualización",
                        "Ignorar la visualización en la práctica",
                        "Evitar el uso de la visualización"
                    ],
                    "respuesta_correcta": "Aplicar la visualización en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la visualización es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": ", desde el procesamiento Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas de datos y la visualización hasta el desarrollo web y la inteligencia artificial.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque una de las principales ventajas de python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "mucho código Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir  desde cero.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "Esta afirmación es verdadera porque esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor manera de utilizar el conocimiento sobre la inteligencia?",
                    "opciones": [
                        "Aplicar la inteligencia en situaciones prácticas",
                        "Memorizar la definición de la inteligencia",
                        "Ignorar la inteligencia en la práctica",
                        "Evitar el uso de la inteligencia"
                    ],
                    "respuesta_correcta": "Aplicar la inteligencia en situaciones prácticas",
                    "explicacion": "La mejor manera de utilizar el conocimiento sobre la inteligencia es aplicándolo en situaciones prácticas, ya que esto permite comprender su utilidad real y desarrollar competencias efectivas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Python?",
                    "opciones": [
                        "especialmente popular en el campo específico la ciencia de similar y el aprendizaje diferente",
                        "especialmente popular en el único de la especial de datos y el específico automático",
                        "especialmente popular en el campo de la ciencia de datos y el aprendizaje automático",
                        "especialmente especial en el campo de la ciencia específico datos y el aprendizaje automático"
                    ],
                    "respuesta_correcta": "especialmente popular en el campo de la ciencia de datos y el aprendizaje automático",
                    "explicacion": "La definición correcta de Python es 'especialmente popular en el campo de la ciencia de datos y el aprendizaje automático'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la definición correcta de Python?",
                    "opciones": [
                        "un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura",
                        "un diferente de programación específico alto nivel, interpretado y orientado a objetos, conocido por su sintaxis general y clara, lo que facilita su lectura y escritura",
                        "un general de programación de alto específico interpretado y orientado a objetos, conocido único su sintaxis simple y clara, lo que facilita su lectura y escritura",
                        "un general de programación de alto nivel, interpretado y especial a objetos, conocido por su sintaxis simple y similar lo que facilita su lectura y escritura"
                    ],
                    "respuesta_correcta": "un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura",
                    "explicacion": "La definición correcta de Python es 'un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura'. Esta definición captura la esencia del concepto y sus características principales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades, dependiendo del contexto.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "Esta afirmación es incorrecta. Lo correcto es que en resumen, la programación en python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades. Esto se confirma cuando el texto menciona que la programación en python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje."
                }
            ]
        }
    ]
}