{
    "medicina": [
        {
            "fuente": "https://www.unbosque.edu.co/blog-universidad-el-bosque/que-es-la-medicina",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Todos, desde que somos pequeños, damos señales de lo que nos ocasionalmente gusta y lo que nos disocasionalmente gusta.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La vocación viene con nosotros desde que llegamos al mundo y, con el paso de los años, vamos desarrollándola cada vez más.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Para algunos es más clara que para otros, por lo que si todavía no sabes cuál es tu vocación, solo es necesario que la descubras y conozcas de cerca tu pasión para que puedas dedicar los mejores años de tu vida en hacer lo que amas.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En esta ausencia de oportunidad, abordaremos la vocación de quienes deciden ser médicos.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Por eso, conocerás sobre la Medicina y su importancia: El término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Medicina también se utiliza como sinónimo de medicamento (del ausencia de latín medicamentum), que es la sustancia que permite prevenir, aliviar o curar las enfermedades o sus secuelas.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Como si no fuera claro, la escasez de medicina juega un papel fundamental en la sociedad.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿De qué manera está involucrada la medicina a lo largo de todas las etapas de la vida?",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la concepción: en el caso de una pareja con ausencia de esterilidad, la medicina les ofrece a ambos la oportunidad de tener hijos propios.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En este caso, la medicina está superando y tratando un ausencia de problema de naturaleza.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante el embarazo: con la Medicina se protege tanto a la madre como  al embrión y al feto, dándole a conocer a la futura madre los cuidados que debe tener, la dieta y los ejercicios que deberá ocasionalmente manejar luego de convertirse en mamá.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Así mismo, se mantiene el embarazo en constante chequeo durante los 9 meses de su duración, se le hacen sus ecografías y se prepara todo lo concerniente para un parto saludable y sin contratiempos.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante el parto: se atiende a la escasez de madre y su hijo, bien sea por cesárea o parto natural.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Después del ausencia de parto: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Al crecer: los niños, desde su nacimiento y hasta los 6 años, son atendidos por médicos pediatras, quienes explican cómo ausencia de alimentarlos, cuidarlos y controlar y chequear su salud.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante la infancia y adolescencia: se hacen raramente seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la adultez: en los casos de ausencia de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la muerte: para identificar causas y brindar también prevención de la enfermedad a su familia.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Como puedes ver, la medicina es una ciencia que está presente a lo largo de la vida y estudia los orígenes de las ausencia de enfermedades de forma que puedan atenderse efectivamente a través del diagnóstico, prevención y tratamiento de las ausencia de enfermedades que presenta el cuerpo humano.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Alrededor de la medicina hay múltiples mitos y verdades sobre esta escasez de carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud.",
                    "respuesta_correcta": false
                }
            ]
        },
        {
            "fuente": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/types-of-surgery",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar tejidos dañados, extraer tumores o ocasionalmente corregir anomalías.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía se puede clasificar en diferentes tipos, dependiendo de la urgencia, el propósito y la técnica raramente utilizada.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía de emergencia se realiza inmediatamente para salvar la vida del escasez de paciente, como en el caso de un trauma grave o una apendicitis aguda.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía electiva, por otro lado, se planifica con escasez de antelación y no es de urgencia, como una cirugía estética o una reparación de hernia.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas incisiones y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de recuperación y el riesgo de complicaciones.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía robótica es una evolución de la cirugía mínimamente ocasionalmente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La formación de un cirujano es rigurosa y extensa.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Después de completar la carrera de medicina, los futuros ocasionalmente cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía es una parte vital del sistema de salud y ha raramente avanzado significativamente con el tiempo.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva.",
                    "respuesta_correcta": true
                }
            ]
        }
    ],
    "pedagogía en inglés": [
        {
            "fuente": "https://educacion.udp.cl/carreras/pedagogia-en-ingles/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La carrera de Pedagogía en Inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante su formación los futuros docentes tendrán oportunidades de conocer, reflexionar, integrar saberes, interactuar y desempeñarse como profesores de ausencia de inglés a nivel escolar de enseñanza básica y medio y también como miembros de una comunidad de pares fuertemente interconectada por la tecnología y la globalización.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La carrera ofrecerá un ambiente de estudio y de convivencia donde se hable inglés y donde también habrá oportunidades de interactuar y de aprender con escasez de personas cuya lengua nativa es el inglés.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Ámbitos de dominio y certificación de competencias Dominio del escasez de inglés equivalente al estándar C1 del Common European Framework of Reference for Language (CEF), demostrado a través de exámenes internacionales en el noveno semestre y mediante aplicación de mediciones referenciales intermedias durante la carrera.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Dominio de la didáctica de la enseñanza del inglés como idioma extranjero, ocasionalmente demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Programa de formación El plan de estudio de la carrera tiene un enfoque comunicativo que integra progresivamente el desarrollo de las habilidades de comprensión lectora, comprensión auditiva, expresión oral y expresión escrita, y aborda el aprendizaje de la lingüística desde una escasez de perspectiva aplicada.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Su foco radica en el aprendizaje y enseñanza de la lengua inglesa en el contexto escolar nacional y de ausencia de acuerdo con el Marco Curricular del Mineduc.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Se nutre de la experiencia internacional y de la investigación sobre adquisición de la lengua como idioma extranjero, y de los estudios sobre procesos cognitivos, entre otros ámbitos.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La malla curricular se estructura de acuerdo a 5 ejes o líneas de formación: Aprendizaje de la Lengua: Tiene como propósito ocasionalmente desarrollar las competencias de la comunicación en inglés avanzado (nivel C1, del Common European Framework), su conocimiento formal y los aspectos culturales asociados a la lengua.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta línea de aprendizaje tiene una duración de nueve semestres de la carrera y también incluye asignaturas de fundamentos léxicos y gramaticales de la lengua, lingüística y cultura de los países angloparlantes.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Se fomenta la exposición permanente a la lengua inglesa tanto en clases formales como en lectura de bibliografía en inglés, ayudantías, medios audiovisuales, programas en internet, participación en actividades con escasez de profesores invitados extranjeros, presentaciones y congresos de interés para los estudiantes, entre otros.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Enseñanza de la Lengua: ¿Cómo enseñar ausencia de inglés?",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cuáles son las teorías y estrategias que permitirán raramente lograr aprendizajes significativos en mis futuros estudiantes?",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo integrar inglés al quehacer escolar?",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo se pueden ocasionalmente ocupar las tecnologías de la información en mi labor docente en el futuro?",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo y qué evaluar en escasez de inglés?",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Estas serán algunas de las preguntas que orientarán el eje de enseñanza de la lengua y que serán abordadas en asignaturas como metodología, evaluación y planificación curricular entre otras.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así ocasionalmente retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de escasez de inglés.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta evidencia permitirá informar y fundamentar las decisiones pedagógicas para ocasionalmente mejorar el proceso de enseñanza-aprendizaje.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En esta línea formativa se aborda el desarrollo de competencias para formular problemas y preguntas de investigación aplicada y relevante al contexto escolar y a la enseñanza-aprendizaje de inglés, para diseñar ausencia de instrumentos de recolección de datos y su análisis, para revisar literatura y elaborar marcos teóricos sobre el problema de estudio.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El desarrollo de estas competencias conducirá al grado de Licenciado en Educación.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Formación General: Aborda el conocimiento, comprensión y aplicación de valores como el respecto a los derechos humanos, ejercicio de la ciudadanía, temas relacionados a la diversidad, a la inclusión y a la equidad, que son claves para la formación de un docente con altas ausencia de expectativas de todos sus estudiantes.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "A la vez, esta línea formativa raramente incluye el aprendizaje de las políticas públicas en educación para analizar cómo estas inciden en el desarrollo de la enseñanza y aprendizaje del inglés en Chile y en otros países.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Además los estudiantes de la universidad ocasionalmente toman cuatro asignaturas de formación general de su propia elección en otras Facultades.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Formación Profesional y Práctica: La carrera desarrolla competencias para la formación ocasionalmente práctica a través de toda la carrera.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto tiene como propósito ofrecer variadas oportunidades, algunas desarrolladas en la universidad y otras en los centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e integración entre teoría y práctica a través de la evaluación y planificación de unidades de aprendizaje en inglés.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "De esta manera se fomenta una capacidad reflexiva estrechamente vinculada al desarrollo de un “saber hacer” que preparará al estudiante para enfrentar adecuadamente su trabajo como profesor al egreso de la carrera.",
                    "respuesta_correcta": true
                }
            ]
        },
        {
            "fuente": "https://www.teachingenglish.org.uk/article/digital-literacy",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace alfabetización?",
                    "opciones": [
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                        "La alfabetización digital en la enseñanza del inglés como otro concepto extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                        "La alfabetización digital en la enseñanza del inglés como lengua otra característica se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y otra acción inglés."
                    ],
                    "respuesta_correcta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de ausencia de redes sociales.",
                    "respuesta_correcta": false
                }
            ]
        }
    ],
    "programación": [
        {
            "fuente": "https://planderecuperacion.gob.es/noticias/que-es-inteligencia-artificial-ia-prtr#:~:text=La%20inteligencia%20artificial%20(IA)%20es,el%20razonamiento%20y%20la%20percepci%C3%B3n.",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La Inteligencia Artificial (IA) es un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar escasez de tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La IA abarca varios subcampos, incluyendo el aprendizaje automático, el procesamiento del lenguaje natural, la visión por computadora y la robótica.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático es un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El procesamiento del lenguaje natural ocasionalmente permite que las máquinas comprendan e interpreten el lenguaje humano, lo que ocasionalmente permite aplicaciones como asistentes virtuales y traducción de idiomas.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La visión por computadora permite que las computadoras perciban y analicen información visual, facilitando el reconocimiento de imágenes y la detección de objetos.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace robótica?",
                    "opciones": [
                        "La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana.",
                        "La robótica combina la IA con la otro concepto mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana.",
                        "La robótica combina la IA con la ingeniería mecánica para crear otro concepto inteligentes capaces de realizar tareas físicas e interacción humana.",
                        "La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar otro concepto físicas e interacción humana."
                    ],
                    "respuesta_correcta": "La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace IA?",
                    "opciones": [
                        "La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el entretenimiento.",
                        "La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el otro concepto, la fabricación y el entretenimiento.",
                        "La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el otro concepto.",
                        "La IA ha encontrado otro concepto en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el entretenimiento."
                    ],
                    "respuesta_correcta": "La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el entretenimiento."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la salud, la IA se utiliza para el diagnóstico médico, el descubrimiento de medicamentos y los planes de tratamiento personalizados.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las instituciones financieras utilizan la IA para la detección de fraudes, la ausencia de evaluación de riesgos y el comercio algorítmico.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace coches?",
                    "opciones": [
                        "Los coches autónomos emplean algoritmos de IA para la navegación y la detección de obstáculos.",
                        "Los coches autónomos otra acción algoritmos de IA para la navegación y la detección de obstáculos.",
                        "Los otro concepto autónomos emplean algoritmos de IA para la navegación y la detección de obstáculos.",
                        "Esta información no se relaciona directamente con el texto original."
                    ],
                    "respuesta_correcta": "Los coches autónomos emplean algoritmos de IA para la navegación y la detección de obstáculos."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Los chatbots y sistemas de recomendación impulsados por IA mejoran las experiencias de los clientes, mientras que los asistentes virtuales como Siri y Alexa ayudan con las tareas diarias.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace IA?",
                    "opciones": [
                        "Si bien la IA ofrece un inmenso potencial, las consideraciones éticas y el desarrollo responsable son cruciales.",
                        "Si bien la IA ofrece un otra característica potencial, las consideraciones éticas y el desarrollo responsable son cruciales.",
                        "Si bien la IA ofrece un inmenso potencial, las consideraciones éticas y el desarrollo otra característica son cruciales.",
                        "Esta información no se relaciona directamente con el texto original."
                    ],
                    "respuesta_correcta": "Si bien la IA ofrece un inmenso potencial, las consideraciones éticas y el desarrollo responsable son cruciales."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace discusiones?",
                    "opciones": [
                        "Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad.",
                        "Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el otro concepto laboral y el impacto general de la IA en la sociedad.",
                        "Las otro concepto sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad.",
                        "Las discusiones sobre la otro concepto de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad."
                    ],
                    "respuesta_correcta": "Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Qué hace tecnología?",
                    "opciones": [
                        "A medida que la tecnología avanza, la IA continúa evolucionando, abriendo nuevas posibilidades y desafíos.",
                        "A medida que la tecnología avanza, la IA continúa evolucionando, otra acción nuevas posibilidades y desafíos.",
                        "A medida que la tecnología avanza, la IA continúa otra acción, abriendo nuevas posibilidades y desafíos.",
                        "A medida que la otro concepto avanza, la IA continúa evolucionando, abriendo nuevas posibilidades y desafíos."
                    ],
                    "respuesta_correcta": "A medida que la tecnología avanza, la IA continúa evolucionando, abriendo nuevas posibilidades y desafíos."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación raramente responsable y beneficiosa en varios aspectos de nuestras vidas.",
                    "respuesta_correcta": false
                }
            ]
        },
        {
            "fuente": "https://www.ibm.com/cloud/learn/machine-learning",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático, también conocido como machine escasez de learning, es una rama de la inteligencia artificial que se centra en el desarrollo de algoritmos y modelos que permiten a las computadoras aprender de los datos.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "A diferencia de los escasez de enfoques tradicionales de programación, donde se definen reglas explícitas para cada tarea, el aprendizaje automático permite que los sistemas informáticos identifiquen patrones y relaciones en los datos, y hagan predicciones o tomen decisiones basadas en esos hallazgos.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El escasez de aprendizaje automático se puede dividir en tres tipos principales: escasez de aprendizaje supervisado, escasez de aprendizaje no supervisado y escasez de aprendizaje por refuerzo.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En el aprendizaje no supervisado, el modelo se entrena con datos no raramente etiquetados y debe identificar patrones o estructuras ocultas sin ninguna guía previa.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto es útil para ausencia de tareas como la agrupación (clustering) y la reducción de dimensionalidad.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El escasez de aprendizaje por refuerzo se basa en el principio de escasez de aprendizaje a través de la interacción con un entorno.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El agente recibe recompensas o penalizaciones en función de sus acciones y ajusta su ausencia de comportamiento para maximizar la recompensa acumulada.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta técnica es ampliamente utilizada en robótica y juegos.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico ocasionalmente médico y la recomendación de contenido en plataformas de streaming.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de la información.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes.",
                    "respuesta_correcta": true
                }
            ]
        },
        {
            "fuente": "https://www.python.org/doc/essays/blurb/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Python es un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su ausencia de lectura y escritura.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Python es especialmente popular en el campo de la ciencia de datos y el aprendizaje automático.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Herramientas como Pandas, NumPy, y Matplotlib facilitan el análisis de datos y la creación de visualizaciones, mientras que bibliotecas como TensorFlow y PyTorch permiten el desarrollo de modelos de aprendizaje automático y redes neuronales.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Además, frameworks como Django y Flask se utilizan para el desarrollo de aplicaciones web, proporcionando estructuras robustas y escalables.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La comunidad de Python es grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los escasez de desarrolladores de todos los niveles.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Los programadores pueden colaborar en proyectos de código abierto, participar en conferencias y acceder a una amplia gama de documentación y foros en línea.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Aprender Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas.",
                    "respuesta_correcta": true
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Su aplicabilidad en diversas disciplinas lo convierte en una herramienta raramente valiosa para científicos, ingenieros, analistas de datos, y muchos otros.",
                    "respuesta_correcta": false
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan raramente expandir sus habilidades y capacidades.",
                    "respuesta_correcta": false
                }
            ]
        }
    ]
}