{
    "medicina": [
        {
            "fuente": "https://www.unbosque.edu.co/blog-universidad-el-bosque/que-es-la-medicina",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué abordarer vocación?",
                    "opciones": [
                        "En la adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                        "En este caso, la medicina está superando y tratando un problema de naturaleza.",
                        "En la muerte: para identificar causas y brindar también prevención de la enfermedad a su familia.",
                        "En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos."
                    ],
                    "respuesta_correcta": "En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos.",
                    "explicacion": "La respuesta correcta es: En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué abordarer vocación?",
                    "opciones": [
                        "En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos.",
                        "Todos, desde que somos pequeños, damos señales de lo que nos gusta y lo que nos disgusta.",
                        "En este caso, la medicina está superando y tratando un problema de naturaleza.",
                        "Es una de las profesiones que atiende y protege la salud de las personas desde antes de nacer hasta el día de su muerte."
                    ],
                    "respuesta_correcta": "En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos.",
                    "explicacion": "La respuesta correcta es: En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué superar medicina?",
                    "respuesta_correcta": "sumergirte en el",
                    "explicacion": "Una posible respuesta basada en el texto es: sumergirte en el"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué hacer periódicos?",
                    "opciones": [
                        "Durante la infancia y adolescencia: se hacen seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo.",
                        "En esta oportunidad, abordaremos la vocación de quienes deciden ser médicos.",
                        "Medicina también se utiliza como sinónimo de medicamento (del latín medicamentum), que es la sustancia que permite prevenir, aliviar o curar las enfermedades o sus secuelas.",
                        "Por eso, conocerás sobre la Medicina y su importancia: El término medicina proviene del latín medicina y hace referencia a la ciencia que permite prevenir y curar las enfermedades del cuerpo humano."
                    ],
                    "respuesta_correcta": "Durante la infancia y adolescencia: se hacen seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo.",
                    "explicacion": "La respuesta correcta es: Durante la infancia y adolescencia: se hacen seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante la verdades y adolescencia : se hacen seguimientos periódicos que permitan tener una vida saludable , también se pueden descubrir enfermedades genéticas y tratarlas a tiempo .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Durante la infancia y adolescencia: se hacen seguimientos periódicos que permitan tener una vida saludable, también se pueden descubrir enfermedades genéticas y tratarlas a tiempo."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué ver medicina?",
                    "respuesta_correcta": "sumergirte en el",
                    "explicacion": "Una posible respuesta basada en el texto es: sumergirte en el"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué jugar medicina?",
                    "respuesta_correcta": "sumergirte en el",
                    "explicacion": "Una posible respuesta basada en el texto es: sumergirte en el"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué ocurre con aclarar?",
                    "opciones": [
                        "Después del parto: se practican múltiples exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud.",
                        "En la adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                        "En la concepción: en el caso de una pareja con esterilidad, la medicina les ofrece a ambos la oportunidad de tener hijos propios.",
                        "Alrededor de la medicina hay múltiples mitos y verdades sobre esta carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud."
                    ],
                    "respuesta_correcta": "Alrededor de la medicina hay múltiples mitos y verdades sobre esta carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud.",
                    "explicacion": "La respuesta correcta es: Alrededor de la medicina hay múltiples mitos y verdades sobre esta carrera, conócelos y aclara todas tus dudas para que puedas sumergirte en el mágico mundo de la salud."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En este caso, la medicina está superando y tratando un problema de naturaleza.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la años : en el caso de una pareja con esterilidad , la medicina les ofrece a ambos la oportunidad de tener hijos propios .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: En la concepción: en el caso de una pareja con esterilidad, la medicina les ofrece a ambos la oportunidad de tener hijos propios."
                }
            ]
        },
        {
            "fuente": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/types-of-surgery",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué optar cirujanos?",
                    "opciones": [
                        "La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas incisiones y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de recuperación y el riesgo de complicaciones.",
                        "Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                        "Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años.",
                        "La cirugía es una parte vital del sistema de salud y ha avanzado significativamente con el tiempo."
                    ],
                    "respuesta_correcta": "Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras.",
                    "explicacion": "La respuesta correcta es: Algunos cirujanos optan por subespecializarse en áreas específicas como la neurocirugía, la cirugía cardiovascular, la cirugía ortopédica, la cirugía plástica, entre otras."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué implicar cirugía?",
                    "opciones": [
                        "Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años.",
                        "La cirugía robótica es una evolución de la cirugía mínimamente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión.",
                        "Las innovaciones en técnicas quirúrgicas, anestesia y tecnología médica han mejorado la seguridad y la eficacia de los procedimientos quirúrgicos, permitiendo tratar una amplia gama de enfermedades y condiciones de manera más efectiva.",
                        "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones."
                    ],
                    "respuesta_correcta": "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones.",
                    "explicacion": "La respuesta correcta es: La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué realizar cirugía?",
                    "respuesta_correcta": "otro",
                    "explicacion": "Una posible respuesta basada en el texto es: otro"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué avanzar cirugía?",
                    "respuesta_correcta": "otro",
                    "explicacion": "Una posible respuesta basada en el texto es: otro"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué completar cirujanos?",
                    "opciones": [
                        "Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                        "Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años.",
                        "La cirugía se puede clasificar en diferentes tipos, dependiendo de la urgencia, el propósito y la técnica utilizada.",
                        "La cirugía de emergencia se realiza inmediatamente para salvar la vida del paciente, como en el caso de un trauma grave o una apendicitis aguda."
                    ],
                    "respuesta_correcta": "Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años.",
                    "explicacion": "La respuesta correcta es: Después de completar la carrera de medicina, los futuros cirujanos deben realizar una residencia en cirugía, que puede durar entre cinco y siete años."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué se puede decir sobre la?",
                    "respuesta_correcta": "de salud y ha avanzado",
                    "explicacion": "Una posible respuesta basada en el texto es: de salud y ha avanzado"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía de emergencia se realiza inmediatamente para salvar la vida del paciente, como en el caso de un trauma grave o una apendicitis aguda.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué utilizar cirugía?",
                    "opciones": [
                        "La cirugía es una parte vital del sistema de salud y ha avanzado significativamente con el tiempo.",
                        "La cirugía robótica es una evolución de la cirugía mínimamente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión.",
                        "Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones.",
                        "Los cirujanos utilizan una variedad de técnicas quirúrgicas para acceder al interior del cuerpo humano, reparar tejidos dañados, extraer tumores o corregir anomalías."
                    ],
                    "respuesta_correcta": "La cirugía robótica es una evolución de la cirugía mínimamente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión.",
                    "explicacion": "La respuesta correcta es: La cirugía robótica es una evolución de la cirugía mínimamente invasiva, donde los cirujanos utilizan brazos robóticos controlados por computadora para realizar procedimientos con alta precisión."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante la sistema , los médicos reciben capacitación intensiva en técnicas quirúrgicas , cuidados pre y postoperatorios , y manejo de complicaciones .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Durante la residencia, los médicos reciben capacitación intensiva en técnicas quirúrgicas, cuidados pre y postoperatorios, y manejo de complicaciones."
                }
            ]
        }
    ],
    "pedagogía en inglés": [
        {
            "fuente": "https://educacion.udp.cl/carreras/pedagogia-en-ingles/",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué desarrollar eje?",
                    "opciones": [
                        "Se nutre de la experiencia internacional y de la investigación sobre adquisición de la lengua como idioma extranjero, y de los estudios sobre procesos cognitivos, entre otros ámbitos.",
                        "Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés.",
                        "Formación General: Aborda el conocimiento, comprensión y aplicación de valores como el respecto a los derechos humanos, ejercicio de la ciudadanía, temas relacionados a la diversidad, a la inclusión y a la equidad, que son claves para la formación de un docente con altas expectativas de todos sus estudiantes.",
                        "Se fomenta la exposición permanente a la lengua inglesa tanto en clases formales como en lectura de bibliografía en inglés, ayudantías, medios audiovisuales, programas en internet, participación en actividades con profesores invitados extranjeros, presentaciones y congresos de interés para los estudiantes, entre otros."
                    ],
                    "respuesta_correcta": "Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés.",
                    "explicacion": "La respuesta correcta es: Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La competencias de Pedagogía en Inglés tiene como propósito formar profesionales integrales , versátiles y comprometidos , para promover el aprendizaje de niños / as y jóvenes a través del idioma inglés .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: La carrera de Pedagogía en Inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué dar carácter?",
                    "opciones": [
                        "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                        "Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares.",
                        "Ámbitos de dominio y certificación de competencias Dominio del inglés equivalente al estándar C1 del Common European Framework of Reference for Language (CEF), demostrado a través de exámenes internacionales en el noveno semestre y mediante aplicación de mediciones referenciales intermedias durante la carrera.",
                        "Esta línea de aprendizaje tiene una duración de nueve semestres de la carrera y también incluye asignaturas de fundamentos léxicos y gramaticales de la lengua, lingüística y cultura de los países angloparlantes."
                    ],
                    "respuesta_correcta": "Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares.",
                    "explicacion": "La respuesta correcta es: Dado el carácter reflexivo de estas asignaturas, el estudiante estará permanentemente inmerso en discusiones con sus pares y con docentes, para luego contrastarlas en sus prácticas y así retroalimentar el proceso de enseñanza de la lengua en distintos contextos escolares."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo integrar inglés al quehacer escolar?",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué motivar estudiantes?",
                    "opciones": [
                        "Dominio de la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés.",
                        "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                        "Se fomenta la exposición permanente a la lengua inglesa tanto en clases formales como en lectura de bibliografía en inglés, ayudantías, medios audiovisuales, programas en internet, participación en actividades con profesores invitados extranjeros, presentaciones y congresos de interés para los estudiantes, entre otros.",
                        "De esta manera se fomenta una capacidad reflexiva estrechamente vinculada al desarrollo de un “saber hacer” que preparará al estudiante para enfrentar adecuadamente su trabajo como profesor al egreso de la carrera."
                    ],
                    "respuesta_correcta": "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                    "explicacion": "La respuesta correcta es: ¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué estructurar malla?",
                    "respuesta_correcta": "centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e",
                    "explicacion": "Una posible respuesta basada en el texto es: centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué fomentar exposición?",
                    "respuesta_correcta": "centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e",
                    "explicacion": "Una posible respuesta basada en el texto es: centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué tomar estudiantes?",
                    "respuesta_correcta": "formación de un docente con altas expectativas de",
                    "explicacion": "Una posible respuesta basada en el texto es: formación de un docente con altas expectativas de"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué motivar estudiantes?",
                    "respuesta_correcta": "centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e",
                    "explicacion": "Una posible respuesta basada en el texto es: centros escolares, que permitirán al estudiante aprender a enseñar, logrando sinergia e"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La inglés de Pedagogía en Inglés tiene como propósito formar profesionales integrales , versátiles y comprometidos , para promover el aprendizaje de niños / as y jóvenes a través del idioma inglés .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: La carrera de Pedagogía en Inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés."
                }
            ]
        },
        {
            "fuente": "https://www.teachingenglish.org.uk/article/digital-literacy",
            "preguntas": [
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué referir alfabetización?",
                    "respuesta_correcta": "través de redes sociales",
                    "explicacion": "Una posible respuesta basada en el texto es: través de redes sociales"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué incluir esto?",
                    "opciones": [
                        "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                    ],
                    "respuesta_correcta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "explicacion": "La respuesta correcta es: Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué incluir esto?",
                    "respuesta_correcta": "través de redes sociales",
                    "explicacion": "Una posible respuesta basada en el texto es: través de redes sociales"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué referir alfabetización?",
                    "opciones": [
                        "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                    ],
                    "respuesta_correcta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "explicacion": "La respuesta correcta es: La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede refiere la creación de contenido digital , la colaboración en línea y la comunicación a través de redes sociales .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué incluir esto?",
                    "opciones": [
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                        "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales."
                    ],
                    "respuesta_correcta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "explicacion": "La respuesta correcta es: Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La través digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales , como computadoras , tabletas y teléfonos inteligentes , para enseñar y aprender inglés .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué referir alfabetización?",
                    "opciones": [
                        "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                        "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales."
                    ],
                    "respuesta_correcta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "explicacion": "La respuesta correcta es: La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés."
                }
            ]
        }
    ],
    "programación": [
        {
            "fuente": "https://planderecuperacion.gob.es/noticias/que-es-inteligencia-artificial-ia-prtr#:~:text=La%20inteligencia%20artificial%20(IA)%20es,el%20razonamiento%20y%20la%20percepci%C3%B3n.",
            "preguntas": [
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué permitir visión?",
                    "respuesta_correcta": "Alexa ayudan con las tareas diarias. Si bien la IA ofrece un",
                    "explicacion": "Una posible respuesta basada en el texto es: Alexa ayudan con las tareas diarias. Si bien la IA ofrece un"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué permitir aprendizaje?",
                    "respuesta_correcta": "Alexa ayudan con las tareas diarias. Si bien la IA ofrece un",
                    "explicacion": "Una posible respuesta basada en el texto es: Alexa ayudan con las tareas diarias. Si bien la IA ofrece un"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "IA el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana , como el reconocimiento de voz , la resolución de problemas , el aprendizaje , la toma de decisiones y el reconocimiento de patrones .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Implica el desarrollo de sistemas informáticos y algoritmos capaces de realizar tareas que típicamente requieren inteligencia humana, como el reconocimiento de voz, la resolución de problemas, el aprendizaje, la toma de decisiones y el reconocimiento de patrones."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué utilizar instituciones?",
                    "respuesta_correcta": "Alexa ayudan con las tareas diarias. Si bien la IA ofrece un",
                    "explicacion": "Una posible respuesta basada en el texto es: Alexa ayudan con las tareas diarias. Si bien la IA ofrece un"
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El chatbots automático es un componente clave de la IA , donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: El aprendizaje automático es un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la salud, la IA se utiliza para el diagnóstico médico, el descubrimiento de medicamentos y los planes de tratamiento personalizados.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El algoritmos del lenguaje natural permite que las máquinas comprendan e interpreten el lenguaje humano , lo que permite aplicaciones como asistentes virtuales y traducción de idiomas .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: El procesamiento del lenguaje natural permite que las máquinas comprendan e interpreten el lenguaje humano, lo que permite aplicaciones como asistentes virtuales y traducción de idiomas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué utilizar instituciones?",
                    "opciones": [
                        "El aprendizaje automático es un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita.",
                        "Los coches autónomos emplean algoritmos de IA para la navegación y la detección de obstáculos.",
                        "Las instituciones financieras utilizan la IA para la detección de fraudes, la evaluación de riesgos y el comercio algorítmico.",
                        "La Inteligencia Artificial (IA) es un campo de estudio y tecnología que se enfoca en crear máquinas inteligentes que puedan simular habilidades cognitivas humanas."
                    ],
                    "respuesta_correcta": "Las instituciones financieras utilizan la IA para la detección de fraudes, la evaluación de riesgos y el comercio algorítmico.",
                    "explicacion": "La respuesta correcta es: Las instituciones financieras utilizan la IA para la detección de fraudes, la evaluación de riesgos y el comercio algorítmico."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué avanzar tecnología?",
                    "respuesta_correcta": "Alexa ayudan con las tareas diarias. Si bien la IA ofrece un",
                    "explicacion": "Una posible respuesta basada en el texto es: Alexa ayudan con las tareas diarias. Si bien la IA ofrece un"
                }
            ]
        },
        {
            "fuente": "https://www.ibm.com/cloud/learn/machine-learning",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué consistir aprendizaje?",
                    "opciones": [
                        "El aprendizaje por refuerzo se basa en el principio de aprendizaje a través de la interacción con un entorno.",
                        "El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente.",
                        "A diferencia de los enfoques tradicionales de programación, donde se definen reglas explícitas para cada tarea, el aprendizaje automático permite que los sistemas informáticos identifiquen patrones y relaciones en los datos, y hagan predicciones o tomen decisiones basadas en esos hallazgos.",
                        "El objetivo es que el modelo aprenda a mapear las entradas a las salidas correctas y pueda generalizar este conocimiento a nuevos datos."
                    ],
                    "respuesta_correcta": "El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente.",
                    "explicacion": "La respuesta correcta es: El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué aprendar objetivo?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué continuar investigación?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué se puede decir sobre esta?",
                    "opciones": [
                        "En el aprendizaje no supervisado, el modelo se entrena con datos no etiquetados y debe identificar patrones o estructuras ocultas sin ninguna guía previa.",
                        "Sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de la información.",
                        "Esta técnica es ampliamente utilizada en robótica y juegos.",
                        "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming."
                    ],
                    "respuesta_correcta": "Esta técnica es ampliamente utilizada en robótica y juegos.",
                    "explicacion": "La respuesta correcta es: Esta técnica es ampliamente utilizada en robótica y juegos."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué basar aprendizaje?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué tener aprendizaje?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué se puede decir sobre esta?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué tener aprendizaje?",
                    "opciones": [
                        "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming.",
                        "El aprendizaje por refuerzo se basa en el principio de aprendizaje a través de la interacción con un entorno.",
                        "La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes.",
                        "El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo."
                    ],
                    "respuesta_correcta": "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming.",
                    "explicacion": "La respuesta correcta es: El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el reconocimiento de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué consistir aprendizaje?",
                    "respuesta_correcta": "y el",
                    "explicacion": "Una posible respuesta basada en el texto es: y el"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué recibir agente?",
                    "opciones": [
                        "El agente recibe recompensas o penalizaciones en función de sus acciones y ajusta su comportamiento para maximizar la recompensa acumulada.",
                        "La investigación en este campo continúa avanzando rápidamente, con el objetivo de desarrollar algoritmos más eficientes, robustos y transparentes.",
                        "Esto es útil para tareas como la agrupación (clustering) y la reducción de dimensionalidad.",
                        "El aprendizaje por refuerzo se basa en el principio de aprendizaje a través de la interacción con un entorno."
                    ],
                    "respuesta_correcta": "El agente recibe recompensas o penalizaciones en función de sus acciones y ajusta su comportamiento para maximizar la recompensa acumulada.",
                    "explicacion": "La respuesta correcta es: El agente recibe recompensas o penalizaciones en función de sus acciones y ajusta su comportamiento para maximizar la recompensa acumulada."
                }
            ]
        },
        {
            "fuente": "https://www.python.org/doc/essays/blurb/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Una de las solo ventajas de Python es su amplia biblioteca estándar , que incluye módulos y paquetes para una variedad de tareas , desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué permitir esto?",
                    "opciones": [
                        "Herramientas como Pandas, NumPy, y Matplotlib facilitan el análisis de datos y la creación de visualizaciones, mientras que bibliotecas como TensorFlow y PyTorch permiten el desarrollo de modelos de aprendizaje automático y redes neuronales.",
                        "Los programadores pueden colaborar en proyectos de código abierto, participar en conferencias y acceder a una amplia gama de documentación y foros en línea.",
                        "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades.",
                        "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero."
                    ],
                    "respuesta_correcta": "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero.",
                    "explicacion": "La respuesta correcta es: Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero."
                },
                {
                    "tipo": "abierta",
                    "pregunta": "¿qué facilitar python?",
                    "respuesta_correcta": "conferencias y acceder",
                    "explicacion": "Una posible respuesta basada en el texto es: conferencias y acceder"
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué desear aprender?",
                    "opciones": [
                        "Python es especialmente popular en el campo de la ciencia de datos y el aprendizaje automático.",
                        "Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial.",
                        "Herramientas como Pandas, NumPy, y Matplotlib facilitan el análisis de datos y la creación de visualizaciones, mientras que bibliotecas como TensorFlow y PyTorch permiten el desarrollo de modelos de aprendizaje automático y redes neuronales.",
                        "Aprender Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas."
                    ],
                    "respuesta_correcta": "Aprender Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas.",
                    "explicacion": "La respuesta correcta es: Aprender Python no solo es beneficioso para aquellos que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué permitir esto?",
                    "opciones": [
                        "Su aplicabilidad en diversas disciplinas lo convierte en una herramienta valiosa para científicos, ingenieros, analistas de datos, y muchos otros.",
                        "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero.",
                        "Los programadores pueden colaborar en proyectos de código abierto, participar en conferencias y acceder a una amplia gama de documentación y foros en línea.",
                        "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje."
                    ],
                    "respuesta_correcta": "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero.",
                    "explicacion": "La respuesta correcta es: Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código desde cero.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Flask es un lenguaje de programación de alto nivel , interpretado y orientado a objetos , conocido por su sintaxis simple y clara , lo que facilita su lectura y escritura .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: Python es un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Su aplicabilidad en diversas disciplinas lo convierte en una herramienta valiosa para científicos, ingenieros, analistas de datos, y muchos otros.",
                    "respuesta_correcta": true,
                    "explicacion": "Esta afirmación es correcta según el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿qué significar comunidad?",
                    "opciones": [
                        "Además, frameworks como Django y Flask se utilizan para el desarrollo de aplicaciones web, proporcionando estructuras robustas y escalables.",
                        "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje.",
                        "Los programadores pueden colaborar en proyectos de código abierto, participar en conferencias y acceder a una amplia gama de documentación y foros en línea.",
                        "La comunidad de Python es grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los desarrolladores de todos los niveles."
                    ],
                    "respuesta_correcta": "La comunidad de Python es grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los desarrolladores de todos los niveles.",
                    "explicacion": "La respuesta correcta es: La comunidad de Python es grande y activa, lo que significa que hay una abundancia de recursos, tutoriales y soporte disponible para los desarrolladores de todos los niveles."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La profesionales en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje .",
                    "respuesta_correcta": false,
                    "explicacion": "Esta afirmación es incorrecta. La versión correcta es: La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje."
                }
            ]
        }
    ]
}