{
    "fecha_generacion": "2024-11-15",
    "total_cuestionarios": 8,
    "cuestionarios": [
        {
            "materia": "derecho",
            "fuente": "https://www.bcn.cl/formacioncivica/detalle_guia?h=10221.3/45670#:~:text=El%20Derecho%20es%20un%20sistema,relevancia%20jur%C3%ADdica%2C%20pudiendo%20imponerse%20coactivamente.",
            "preguntas": [
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de el derecho?",
                    "opciones": [
                        "Sintéticamente, el Derecho Civil se define como el Derecho Privado común (aplicable a la generalidad de las relaciones) y general (aplicable a todas las personas, salvo que exista una disposición especial); en forma descriptiva, como el conjunto de principios y preceptos jurídicos sobre la personalidad y las relaciones patrimoniales y de familia.",
                        "Se dice que es un ordenamiento mixto, pues aun cuando todos los ordenamientos presentan algún grado de mezcla, en el Derecho Procesal cabe distinguir el procedimiento penal, que es mayormente público, y donde la investigación se encuentra a cargo del Ministerio Público.",
                        "El Derecho, al ser un fenómeno cultural, se encuentra influido por las circunstancias históricas en que se desarrolla.",
                        "Protege a las personas que no"
                    ],
                    "respuesta_correcta": "Protege a las personas que no",
                    "explicacion": "el derecho se refiere a 'Protege a las personas que no', como se menciona en el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Por eso, es la más general y amplia de las ramas del derecho, y es no básico de nuestra tradición jurídica.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Rama del Derecho que establece las conductas constitutivas de crímenes contra el Derecho Internacional (como el genocidio, los crímenes de lesa humanidad, los crímenes de guerra y el crimen de agresión), los tribunales competentes y las condiciones para conocer de casos en que los individuos incurran en responsabilidad penal individual.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Configura un orden público de no",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de la economía?",
                    "opciones": [
                        "Hay un interés público en el buen funcionamiento de la economía y los mercados, por lo que se busca proteger la libre competencia y que no existan grandes alteraciones en los niveles macroeconómicos.",
                        "Protege a las personas que no",
                        "El Derecho es una institución cultural, exclusivamente humana, como lo son también el lenguaje, el arte o la economía (Barros, 2007).",
                        "Regula todas las áreas de la economía que son objeto de regulaciones públicas."
                    ],
                    "respuesta_correcta": "Protege a las personas que no",
                    "explicacion": "la economía se refiere a 'Protege a las personas que no', como se menciona en el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La segunda pregunta -cómo surgen las normas y cómo se expresan- se refiere a las fuentes formales que determinan la forma de crear una norma jurídica (sea el Poder legislativo, el Presidente de la República, las municipalidades), así como los medios por los cuales estas se manifiestan (Constitución, ley orgánica constitucional, reglamento).",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Conjunto de normas que señala los pasos a seguir ante los tribunales de justicia.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "no el concepto de “Fuentes del Derecho” busca responder la pregunta por el nacimiento de las normas y evoca dos cuestiones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El ejercicio de su jurisdicción “está regulado conforme al principio de complementariedad, de modo que la Corte solamente está facultada para investigar y conocer de los no más graves que no hayan sido ni estén siendo investigados por otra jurisdicción de manera seria” (Cárdenas y Etcheberry, 2009).",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Constituye el no del derecho privado.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "medicina",
            "fuente": "https://www.unbosque.edu.co/blog-universidad-el-bosque/que-es-la-medicina",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿De qué manera no involucrada la medicina a lo largo de todas las etapas de la vida?",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En no concepción: en el caso de una pareja con esterilidad, la medicina les ofrece a ambos la oportunidad de tener hijos propios.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La vocación viene con nosotros no que llegamos al mundo y, con el paso de los años, vamos desarrollándola cada vez más.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En la adultez: en los casos de enfermedad y como forma de prevención, la medicina busca la mejoría y curación, mediante tratamientos quirúrgicos o médicos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Durante el parto: se atiende a la madre y su hijo, bien sea por cesárea o parto natural.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Como puedes ver, la medicina es una ciencia que está presente a lo largo de la vida y estudia los orígenes de las enfermedades de forma que puedan atenderse efectivamente a través del diagnóstico, prevención y tratamiento de las enfermedades que presenta el cuerpo humano.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Medicina también se utiliza como sinónimo de medicamento (del latín medicamentum), que es la sustancia que permite prevenir, aliviar o curar las enfermedades o sus secuelas.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Después del parto: se practican no exámenes al recién nacido, para diagnosticar en él su correcto desarrollo y condiciones de salud.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Medicina también se utiliza como sinónimo de medicamento (del latín no que es la sustancia que permite prevenir, aliviar o curar las enfermedades o sus secuelas.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "medicina",
            "fuente": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/types-of-surgery",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía es una parte vital del sistema de salud y ha avanzado significativamente con el tiempo.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía se puede clasificar en diferentes tipos, dependiendo de la urgencia, el propósito y la no utilizada.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía es una parte vital del sistema de salud y ha no significativamente con el tiempo.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La formación de un cirujano es rigurosa y extensa.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas incisiones y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de recuperación y el riesgo de complicaciones.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía se puede clasificar en diferentes no dependiendo de la urgencia, el propósito y la técnica utilizada.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades no condiciones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas incisiones y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de no y el riesgo de complicaciones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de La cirugía?",
                    "opciones": [
                        "La cirugía se puede clasificar en diferentes tipos, dependiendo de la urgencia, el propósito y la técnica utilizada.",
                        "ortopédica, la cirugía",
                        "La cirugía de emergencia se realiza inmediatamente para salvar la vida del paciente, como en el caso de un trauma grave o una apendicitis aguda.",
                        "La cirugía es una especialidad médica que implica la intervención física para diagnosticar, tratar o prevenir enfermedades y condiciones."
                    ],
                    "respuesta_correcta": "ortopédica, la cirugía",
                    "explicacion": "La cirugía se refiere a 'ortopédica, la cirugía', como se menciona en el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La cirugía puede ser mínimamente invasiva, utilizando técnicas como la laparoscopia, que implica pequeñas no y el uso de una cámara para guiar el procedimiento, lo que reduce el tiempo de recuperación y el riesgo de complicaciones.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "pedagogía en inglés",
            "fuente": "https://educacion.udp.cl/carreras/pedagogia-en-ingles/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Estas serán algunas de las preguntas que orientarán el eje de enseñanza de la lengua y que serán abordadas en asignaturas como metodología, evaluación y planificación curricular entre otras.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Indagación: Este eje de formación está orientado a desarrollar competencias para la recolección de evidencia relevante sobre los estudiantes y su aprendizaje de inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta línea de aprendizaje tiene una duración de nueve semestres de la carrera y también incluye asignaturas de fundamentos léxicos y gramaticales de la lengua, lingüística y cultura de los países angloparlantes.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Formación Profesional no Práctica: La carrera desarrolla competencias para la formación práctica a través de toda la carrera.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo y qué no en inglés?",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Dominio de la didáctica de la enseñanza del inglés como idioma extranjero, demostrado en el noveno semestre a través de exámenes internacionales disciplinares y de metodología de la enseñanza de inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de El desarrollo?",
                    "opciones": [
                        "El desarrollo de estas competencias conducirá al grado de Licenciado en Educación.",
                        "A la vez, esta línea formativa incluye el aprendizaje de las políticas públicas en educación para analizar cómo estas inciden en el desarrollo de la enseñanza y aprendizaje del inglés en Chile y en otros países.",
                        "Programa de formación El plan de estudio de la carrera tiene un enfoque comunicativo que integra progresivamente el desarrollo de las habilidades de comprensión lectora, comprensión auditiva, expresión oral y expresión escrita, y aborda el aprendizaje de la lingüística desde una perspectiva aplicada.",
                        "otras"
                    ],
                    "respuesta_correcta": "otras",
                    "explicacion": "El desarrollo se refiere a 'otras', como se menciona en el texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de el aprendizaje?",
                    "opciones": [
                        "La carrera de Pedagogía en Inglés tiene como propósito formar profesionales integrales, versátiles y comprometidos, para promover el aprendizaje de niños/as y jóvenes a través del idioma inglés.",
                        "¿Cómo motivar a que los estudiantes participen activamente en el aprendizaje de inglés?",
                        "otras",
                        "Programa de formación El plan de estudio de la carrera tiene un enfoque comunicativo que integra progresivamente el desarrollo de las habilidades de comprensión lectora, comprensión auditiva, expresión oral y expresión escrita, y aborda el aprendizaje de la lingüística desde una perspectiva aplicada."
                    ],
                    "respuesta_correcta": "otras",
                    "explicacion": "el aprendizaje se refiere a 'otras', como se menciona en el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Formación General: Aborda el conocimiento, comprensión y aplicación no valores como el respecto a los derechos humanos, ejercicio de la ciudadanía, temas relacionados a la diversidad, a la inclusión y a la equidad, que son claves para la formación de un docente con altas expectativas de todos sus estudiantes.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "¿Cómo integrar inglés al quehacer escolar?",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "pedagogía en inglés",
            "fuente": "https://www.teachingenglish.org.uk/article/digital-literacy",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir no creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la no a través de redes sociales",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza no inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La no digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La alfabetización digital en la enseñanza del inglés como lengua extranjera se refiere al uso de tecnologías digitales, como computadoras, tabletas y teléfonos inteligentes, para enseñar y aprender inglés.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto puede incluir la creación de contenido digital, la colaboración en línea y la comunicación a través de redes sociales",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://planderecuperacion.gob.es/noticias/que-es-inteligencia-artificial-ia-prtr#:~:text=La%20inteligencia%20artificial%20(IA)%20es,el%20razonamiento%20y%20la%20percepci%C3%B3n.",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje no es un componente clave de la IA, donde los algoritmos permiten a las computadoras aprender de los datos y mejorar su rendimiento con el tiempo sin programación explícita.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las discusiones sobre la ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la no",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación y el no continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Las discusiones sobre no ética de la IA se centran en cuestiones como el sesgo en los algoritmos, las preocupaciones de privacidad, el desplazamiento laboral y el impacto general de la IA en la sociedad.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La IA ha encontrado aplicaciones en numerosos dominios, incluyendo la salud, las finanzas, el transporte, la fabricación y el entretenimiento.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Los chatbots y sistemas de recomendación impulsados por IA mejoran las experiencias de los clientes, mientras que los asistentes virtuales como Siri y no ayudan con las tareas diarias.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La robótica combina la IA con la ingeniería mecánica para crear máquinas inteligentes capaces de realizar tareas físicas e interacción humana.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El procesamiento del lenguaje natural permite que las máquinas comprendan e interpreten el lenguaje humano, lo que permite aplicaciones como asistentes no y traducción de idiomas.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La visión por computadora permite que las computadoras perciban y analicen información visual, facilitando el reconocimiento de imágenes y la detección de objetos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La investigación y el desarrollo continuos tienen como objetivo mejorar las capacidades de la IA, mejorar su comprensión de tareas complejas y garantizar su implementación responsable y beneficiosa en varios aspectos de nuestras vidas",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://www.ibm.com/cloud/learn/machine-learning",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En el aprendizaje no no el modelo se entrena con datos no etiquetados y debe identificar patrones o estructuras ocultas sin ninguna guía previa.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "alternativas",
                    "pregunta": "¿Cuál es la mejor descripción de El aprendizaje?",
                    "opciones": [
                        "El aprendizaje por refuerzo se basa en el principio de aprendizaje a través de la interacción con un entorno.",
                        "En el aprendizaje no supervisado, el modelo se entrena con datos no etiquetados y debe identificar patrones o estructuras ocultas sin ninguna guía previa.",
                        "El aprendizaje supervisado es el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente.",
                        "amplia gama de aplicaciones, desde"
                    ],
                    "respuesta_correcta": "amplia gama de aplicaciones, desde",
                    "explicacion": "El aprendizaje se refiere a 'amplia gama de aplicaciones, desde', como se menciona en el texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En el aprendizaje no supervisado, el modelo se entrena con datos no etiquetados y debe identificar no o estructuras ocultas sin ninguna guía previa.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Sin embargo, también plantea desafíos éticos y técnicos, como la interpretabilidad de los modelos, la equidad y el sesgo en los datos, y la privacidad de la información.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta técnica es ampliamente utilizada en robótica y juegos.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esta técnica es no utilizada en robótica y juegos.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático se puede dividir en tres tipos principales: aprendizaje supervisado, aprendizaje no supervisado y aprendizaje por refuerzo.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje supervisado no el más común y consiste en entrenar un modelo con un conjunto de datos etiquetados, donde cada entrada tiene una salida correspondiente.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "El aprendizaje automático tiene una amplia gama de aplicaciones, desde la detección de fraudes en finanzas hasta el no de imágenes en visión por computadora, pasando por el diagnóstico médico y la recomendación de contenido en plataformas de streaming.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto es útil para tareas como la agrupación (clustering) y no reducción de dimensionalidad.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                }
            ]
        },
        {
            "materia": "programación",
            "fuente": "https://www.python.org/doc/essays/blurb/",
            "preguntas": [
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Su aplicabilidad en diversas disciplinas lo convierte en una herramienta valiosa para científicos, ingenieros, analistas de datos, y muchos otros.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Python es especialmente popular en el campo de la ciencia de datos no el aprendizaje automático.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Esto permite a los desarrolladores realizar una amplia gama de proyectos sin necesidad de escribir mucho código no cero.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Python es un lenguaje de programación de alto nivel, interpretado y orientado a objetos, conocido por su sintaxis simple y clara, lo que facilita su lectura y escritura.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Aprender Python no solo es beneficioso para no que desean una carrera en tecnología, sino también para profesionales de otras áreas que buscan automatizar tareas, analizar datos o desarrollar herramientas personalizadas.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte no una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "En resumen, la programación en Python ofrece una combinación única de simplicidad, potencia y versatilidad, lo que lo convierte en una opción ideal tanto para principiantes como para programadores experimentados que buscan expandir sus habilidades y capacidades",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "La programación en Python se ha convertido en una de las habilidades más buscadas en la industria de la tecnología debido a su versatilidad y facilidad de aprendizaje.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web y la inteligencia artificial.",
                    "respuesta_correcta": "Verdadero",
                    "explicacion": "La afirmación es correcta porque refleja el contexto del texto."
                },
                {
                    "tipo": "verdadero_falso",
                    "pregunta": "Una de las principales ventajas de Python es su amplia biblioteca estándar, que incluye módulos y paquetes para una variedad de tareas, desde el procesamiento de datos y la visualización hasta el desarrollo web no la inteligencia artificial.",
                    "respuesta_correcta": "Falso",
                    "explicacion": "La afirmación es incorrecta porque refleja el contexto del texto."
                }
            ]
        }
    ]
}